SensorsIot/OCPP-ESP32-Server/ocpp-esp32/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32"

# Flash size (4MB)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# Watchdog
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_ESP_TASK_WDT_PANIC=y

# WiFi
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

# Ethernet SPI (W5500)
CONFIG_ETH_USE_SPI_ETHERNET=y
CONFIG_ETH_SPI_ETHERNET_W5500=y

# NVS — enable encryption for production (requires flash encryption or NVS key partition)
# CONFIG_NVS_ENCRYPTION=y
CONFIG_NVS_ENCRYPTION=n

# Console
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# Networking
CONFIG_LWIP_IPV4=y
CONFIG_LWIP_DHCPS=y

# HTTP server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=512
CONFIG_HTTPD_WS_SUPPORT=y

# Optimization
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
